eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ПрефиксыИнформационныхБаз/ПрефиксыИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрефиксыИнформационныхБаз</name>
  <dimensions>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/kwr_УстановкаДатыСФ/kwr_УстановкаДатыСФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>kwr_УстановкаДатыСФ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БратьИзПоляДатаСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/CommonModules/kwr_ОбщиеСерверКлиентПовтИсп/Module.bsl
// НайтиВСправочнике_ас_ПериодыОтражения
// Для ускорения, после этого один раз в сеансе запускается
// Параметры
//  <КодПоиска>  - <Строка> - код поиска
//  <НужнаяГруппа>  - <СправочникиСсылка.ас_ПериодыОтражения> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <СправочникиСсылка.ас_ПериодыОтражения.>   - <описание возвращаемого значения>
//
// {{KM WARE Семенов И.С. Заявка № 15.07.2015 начало
функция НайтиВСправочнике_ас_ПериодыОтражения(КодПоиска,НужнаяГруппа) экспорт
	возврат Справочники.ас_ПериодыОтражения.НайтиПоКоду(КодПоиска,,НужнаяГруппа);
конецфункции
// НайтиВСправочнике_ас_ПериодыОтражения() }}KM WARE Семенов И.С. Заявка № 15.07.2015 окончание


// ПолучитьСписокДоступныхРолейПользователя
// Для ускорения, после этого один раз в сеансе запускается
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Семенов И.С. Заявка № 15.07.2015 начало
Функция ПолучитьСписокДоступныхРолейПользователя(ТекПользователь, Организация) экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	РолиИИсполнители.Роль
	                      |ИЗ
	                      |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	                      |ГДЕ
	                      |	РолиИИсполнители.Исполнитель = &ТекПользователь
	                      |	И ВЫБОР
	                      |			КОГДА &ОтборПоОрганизации
	                      |				ТОГДА РолиИИсполнители.Организация = &Организация
												//Сторчевой А.Н. 18.01.2017 7766416 {                                                                                 
	                      |						ИЛИ РолиИИсполнители.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
												// } Сторчевой А.Н. 18.01.2017 7766416
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
						  //АБС ВСТАВКА №44882 НАЧАЛО «26 июня 2014 г.», Пополитов
						  |	И РолиИИсполнители.Роль <> ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
						  //\\АБС ВСТАВКА №44882 КОНЕЦ  	             
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РолиИИсполнители.Роль");
	Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
	
	Запрос.УстановитьПараметр("ОтборПоОрганизации", НЕ Организация = Неопределено);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Роль");
конецфункции
// ПолучитьСписокДоступныхРолейПользователя() }}KM WARE Семенов И.С. Заявка № 15.07.2015 окончание


// ПолучитьМассивПрефиксовРИБ
// Для ускорения, после этого один раз в сеансе запускается
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Семенов И.С. Заявка № 18.07.2015 начало
Функция ПолучитьМассивПрефиксовРИБ() экспорт
	
	МассивПрефиксов = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ Различные
	               |	ПрефиксыИнформационныхБаз.Префикс КАК Префикс
	               |ИЗ
	               |	РегистрСведений.ПрефиксыИнформационныхБаз КАК ПрефиксыИнформационныхБаз";
	
	ВыборкаУзлов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		
		Если Не ПустаяСтрока(ВыборкаУзлов.Префикс) Тогда
			
			МассивПрефиксов.Добавить(ВыборкаУзлов.Префикс);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат МассивПрефиксов;
	
КонецФункции
// ПолучитьМассивПрефиксовРИБ() }}KM WARE Семенов И.С. Заявка № 18.07.2015 окончание

// ПланыСчетовХозрасчетныйНайтиПоКоду
// Для ускорения, после этого один раз в сеансе запускается
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Семенов И.С. Заявка № 22.07.2015 начало
Функция ПланыСчетовХозрасчетныйНайтиПоКоду(КодСчета) экспорт
	возврат ПланыСчетов.Хозрасчетный.НайтиПоКоду(КодСчета);
конецфункции
// ПланыСчетовХозрасчетныйНайтиПоКоду() }}KM WARE Семенов И.С. Заявка № 22.07.2015 окончание

// {{KM WARE Семенов И.С. Заявка № ... 14.01.2016 начало
// ускорение книги покупок/продаж
функция Регистрысведений_kwr_УстановкаДатыСФ_ПроверкаДаты(ДатаСФ,Организация) экспорт
	возврат Регистрысведений.kwr_УстановкаДатыСФ.ПроверкаДаты(ДатаСФ,Организация)
конецфункции
// }}KM WARE Семенов И.С. Заявка № ... 14.01.2016 окончание
